// ? Основная информация о поездах:
// Номер поезда: Уникальный идентификатор каждого поезда.
// Маршрут: Начальная и конечная станции, промежуточные остановки.
// Расписание: Точное время отправления и прибытия на каждой станции.
// Тип поезда: Пассажирский, грузовой, скоростной и т.д.
// Количество вагонов: Для пассажирских поездов может быть указано количество вагонов разных типов (плацкарт, купе, СВ и т.д.).

// ? Дополнительная информация:
// Задержки: Информация о текущих или прогнозируемых задержках в движении поезда.
// Платформа: Номер платформы, с которой отправляется поезд.
// Тип вагона: Для пассажиров, желающих выбрать конкретный тип вагона.
// Наличие мест: Информация о свободных местах в каждом типе вагона.
// Услуги на борту: Wi-Fi, розетки, кафе, бар и другие дополнительные услуги.
// Стоимость билетов: Информация о стоимости проезда в различных классах.
// Правила провоза багажа: Ограничения на вес, габа риты и количество багажа.

// ? Функционал:
// Поиск поездов: Позволить пользователю искать поезда по различным критериям (маршрут, дата, время отправления).
// Бронирование билетов: Возможность бронирования и покупки билетов непосредственно через приложение.
// Отслеживание поезда в реальном времени: Информация о текущем местоположении поезда на карте.
// Уведомления: Пользователь может подписаться на уведомления о задержках, изменениях в расписании или прибытии поезда на станцию.
// История поездок: Сохранение истории ранее совершенных поездок.
// Интерактивная карта: Визуальное представление маршрута поезда на карте.

// ? Дополнительные возможности:
// Интеграция с другими сервисами: Например, с картами, навигаторами, платежными системами.
// Персонализация: Возможность сохранения часто используемых маршрутов, предпочтений по типу поезда и т.д.
// Офлайн режим: Доступ к некоторым функциям приложения без подключения к интернету.
// Визуальное представление данных:
// Четкий и понятный интерфейс: Информация должна быть представлена в удобном для восприятия виде.
// Использование графиков и диаграмм: Например, для отображения времени в пути, стоимости билетов.
// Интуитивное управление: Пользователь должен легко ориентироваться в приложении.

// ?информацию об отправлении поездов
// TODO: Сделать по городам, по типам компании, и т.п
